In [126]:
import pandas as pd
import numpy as np

In [127]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm','Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [128]:
lst=[]
i=0
num = 10045.0
def abc(num,i):
    while(i<=4):
        print(num)
        lst.append(int(num))
        num = num+10.0
        i+=1
    return lst
abc(num,i)

df["FlightNumber"] = lst
df

10045.0
10055.0
10065.0
10075.0
10085.0

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

In [129]:
df[['From','To']]=df.From_To.str.split('_',expand=True)
df = df.drop('From_To',axis=1)

In [130]:
df_cap = df['From'].str.capitalize()
df_cap

0      London
1      Madrid
2      London
3    Budapest
4    Brussels
Name: From, dtype: object

In [131]:
df["From"] = df_cap
df

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    London      paris
1         10055            []    <Air France> (12)    Madrid      miLAN
2         10065  [24, 43, 87]  (British Airways. )    London  StockhOlm
3         10075          [13]       12. Air France  Budapest      PaRis
4         10085      [67, 32]          "Swiss Air"  Brussels     londOn

In [134]:
df[['delay1','delay2','delay3']] = pd.DataFrame(df.RecentDelays.to_list(), index= df.index)
df=df.drop('RecentDelays',axis=1)
df

,FlightNumber,Airline,From,To,delay1,delay2,delay3
0,10045,KLM(!),London,paris,23.0,47.0,NaN
1,10055,<Air France> (12),Madrid,miLAN,NaN,NaN,NaN
2,10065,(British Airways. ),London,StockhOlm,24.0,43.0,87.0
3,10075,12. Air France,Budapest,PaRis,13.0,NaN,NaN
4,10085,"""Swiss Air""",Brussels,londOn,67.0,32.0,NaN